Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སོ་སོ་ནས་གནོད་སྦྱིན་གྱི་འཁོར་ལྔ་བརྒྱ་ལྔ་བརྒྱ་མཆིས་པས་རྟག་པར་གནས་དེ་དང་དེ་དག་ཏུ་མདོ་སྡེ་འདི་དང་། ཆོས་སྨྲ་བ་དེ་དག་ལ་ཡོངས་སུ་བསྲུང་ཞིང་ཡོངས་སུ་སྐྱོབ་པར་བྱེད་པས་ཡེ་ཤེས་ཀྱི་སྣང་བས་ཡོངས་སུ་སྐྱོབ་པར་བགྱིད་དོ།
en: They said to the Bhagavat, “Bhagavat, we, the Four Mahārājas, each with a following of five hundred yakṣas, will always be present and perfectly guard here and there this sūtra and those dharmabhāṇakas and defend them so that they will be defended by the light of wisdom.

source: །གལ་ཏེ་མདོ་སྡེ་འདིའི་ཚིག་དང་། དོན་བསྐྱུད་པ་ཞིག་མཆིས་ན་ཡང་བདག་ཅག་གིས་དེ་དག་རྗེས་སུ་དྲན་ཞིང་མི་བསྐྱུད་པར་བགྱི་བའི་སླད་དུ་གཟུངས་ཀྱི་སྒོ་ཤིན་ཏུ་ཁྱད་པར་དུ་འཕགས་པ་སྩལ་ནས་ཡོངས་སུ་རྫོགས་པར་བགྱིད་དོ།
en: If any line of verse or word of this sūtra is omitted, in order that they be remembered and not omitted, we will bestow an extremely superior doorway to the power of retention, so that the sūtra will be complete. “

source: །གཞན་ཡང་མདོ་སྡེའི་རྒྱལ་པོ་མཆོག་དམ་པ་འདི་གང་དུ་གནས་པ་དེར་སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་སྤེལ་ཞིང་མྱུར་དུ་ནུབ་པར་མི་འགྱུར་བར་བགྱིད་ལགས་སོ།
en: Moreover, we will ensure that this sublime, supreme king of sūtras, wherever it is present, will be promulgated widely among beings and will not quickly vanish.”

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་མང་པོའི་ནང་དུ་ཆོས་འདི་བསྟན་པ་ན་སེམས་ཅན་ཚད་མེད་པ་སྙེད་ཤེས་རབ་ཆེན་པོའི་སྤོབས་པ་ཐོབ་ནས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་སྙེད་ཡོངས་སུ་བསྡུས་ཏེ་མྱ་ངན་གྱི་གནོད་པ་དང་བྲལ་ནས་རབ་ཏུ་དགའ་བའི་སེམས་ཐོབ་པར་གྱུར་པས་བསྟན་བཅོས་སྣ་ཚོགས་ལ་རབ་ཏུ་མཁས་པ་དང་། ངེས་པར་འབྱུང་བའི་ལམ་ཐོབ་ནས་ཕྱིར་མི་ལྡོག་པར་གྱུར་པས་མྱུར་དུ་བྱང་ཆུབ་མངོན་པར་རྟོགས་པར་གྱུར་ཏོ།
en: At that time, when the Bhagavat taught this Dharma within that large assembly, countless beings gained the eloquence of great wisdom and accumulated an incalculable aggregation of merit; freed from the harm of misery, they attained happiness of mind, became learned in various treatises, attained the path of abandoning saṃsāra, became irreversible, and quickly realized enlightenment.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་གིས་ཡུལ་བསྲུང་བའི་ལེའུ་སྟེ་བཅུ་གཉིས་པའོ།། །།གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ།
en: This concludes “The Four Mahārājas Protecting the Land,” the twelfth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: བམ་པོ་བདུན་པ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཆོས་ཀྱི་རྣམ་གྲངས་མངོན་པར་ཞེན་པ་མེད་པའི་གཟུངས་ཞེས་བྱ་བ་ཡོད་དེ།
en: Chapter 13: The Dhāraṇī of Nonattachment Then the Bhagavat said to Venerable Śāriputra, “Śāriputra, there is the Dharma teaching called ‘The Dhāraṇī of Nonattachment.’

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་མངོན་པར་བསྒྲུབ་པར་བྱ་བའི་ཆོས།
en: It is a Dharma that must be accomplished by the bodhisattvas.

source: འདས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བ།
en: It was held by the bodhisattvas of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མར་གྱུར་པ་ཡིན་ནོ།
en: It is the mother of the bodhisattvas.”

source: །ཞེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གཟུངས་ཞེས་བགྱི་བ་གང་གི་ཚིག་དང་དོན་གང་ཞིག་ལགས།
en: Venerable Śāriputra asked the Bhagavat, “Bhagavat, what is the word and the meaning of dhāraṇī?

source: བཅོམ་ལྡན་འདས་གཟུངས་ཞེས་བགྱི་བ་ནི་ཕྱོགས་དང་གནས་མ་ལགས་པ།
en: Bhagavat, that which is called dhāraṇī does not have a direction or location.

source: ཕྱོགས་དང་གནས་མ་ལགས་པ་ཡང་མ་ལགས་སོ་ཞེས་དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Neither is it without a direction or location.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཁྱོད་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གཞོལ་ཞིང་། ཐེག་པ་ཆེན་པོ་ལ་མངོན་པར་ཡིད་ཆེས་ནས། ཐེག་པ་ཆེན་པོ་ལ་བླ་མར་བྱས་པ་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavat replied to Venerable Śāriputra, “Śāriputra, it is excellent, excellent that you have correctly entered the Mahāyāna, that you believe in the Mahāyāna, and that you revere the Mahāyāna.

source: །ཁྱོད་ཀྱིས་ཇི་སྐད་སྨྲས་པ་བཞིན་དུ་གཟུངས་ཞེས་བྱ་བ་ནི་ཕྱོགས་དང་གནས་ཡོད་པ་ཡང་མ་ཡིན། ཕྱོགས་དང་གནས་མེད་པ་ཡང་མ་ཡིན།
en: As you have said, that which is called dhāraṇī does not have an existing direction or location, and neither is it without an existent direction or location.

source: ཆོས་ཀྱང་མ་ཡིན།
en: It is not a phenomenon.

source: ཆོས་མ་ཡིན་པ་ཡང་མ་ཡིན།
en: It is not a nonphenomenon.

source: འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན།
en: It is not past, it is not future, and it is not present.

source: དངོས་པོ་ཡང་མ་ཡིན། དངོས་པོ་མ་ཡིན་པ་ཡང་མ་ཡིན།
en: It is not a thing, and it is not nothing.

source: རྐྱེན་ཡང་མ་ཡིན། རྐྱེན་མ་ཡིན་པ་ཡང་མ་ཡིན།
en: It is not a condition, and it is not a noncondition.

source: འདུ་བྱེད་ཀྱང་མ་ཡིན། འདུ་བྱེད་མ་ཡིན་པ་ཡང་མ་ཡིན།
en: It is not composite, and it is not noncomposite.

source: ཆོས་སྐྱེ་བར་འགྱུར་བ་ཡང་མེད། ཆོས་འགག་པར་འགྱུར་བ་ཡང་མེད་མོད་ཀྱི།
en: It is not the creation of a phenomenon, and it is not the cessation of a phenomenon. “

source: འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་དེ་སྐད་དུ་བསྟན་པ་ཡིན་ཏེ་གཟུངས་འདིའི་ཡོན་ཏན་གྱི་ནུས་པ་དང་ཡང་དག་པའི་ལམ་གྱི་ཚུལ་དང་མཐུ་སྟོབས་རྣམ་པར་གཞག་པ་གང་ཡིན་པ་དེ་ནི་སངས་རྒྱས་རྣམས་ཀྱི་ཡོན་ཏན་དང་།
en: Nevertheless, in order to benefit bodhisattvas, that word is taught.

source: སངས་རྒྱས་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་དང་། སངས་རྒྱས་རྣམས་ཀྱི་བསླབ་པ་དང་། སངས་རྒྱས་རྣམས་ཀྱི་གསང་བའི་དགོངས་པ་དང་། སངས་རྒྱས་རྣམས་ཀྱི་སྐྱེ་བའི་འབྱུང་གནས་ཡིན་པའི་ཕྱིར་མངོན་པར་ཞེན་པ་མེད་པའི་གཟུངས་མཆོག་ཏུ་གྱ་ནོམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཞེས་བྱའོ།
en: The power of the qualities of a dhāraṇī, the way of its valid path, and the presentation of its might are the qualities of the buddhas, the correct conduct of the buddhas, the training of the buddhas, the secret intention of the buddhas, and the source of the appearance of the buddhas, and therefore ‘The Dhāraṇī of Nonattachment’ is a supremely wonderful Dharma teaching.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདེ་བར་གཤེགས་པས་བདག་ལ་གཟུངས་འདིའི་ཆོ་ག་གང་ལགས་པ་བཀས་བཤད་དུ་གསོལ།
en: Then Venerable Śāriputra said to the Bhagavat, “Bhagavat Sugata, I pray that you teach the practice of this dhāraṇī to me.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་འདི་ལ་གནས་པར་གྱུར་ན་བླ་ན་མ་མཆིས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པར་མི་འགྱུར་ཞིང་ཡང་དག་པའི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་ནས་གནས་མ་མཆིས་པ་དང་། རང་བཞིན་གྱི་སྤོབས་པ་འཐོབ་པར་འགྱུར་བ་དང་།
en: If bodhisattvas remain within this, they will become irreversible from enlightenment, their valid prayers will be fulfilled, they will have no location, they will attain natural eloquence, and they will attain that which is marvelous and wonderful.

source: ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དངོས་པོ་ཐོབ་ནས་འཕགས་པའི་ལམ་ལ་གནས་པར་འགྱུར་བ་འདི་དག་ཐམས་ཅད་ཀྱང་གཟུངས་འདི་ཐོབ་པར་འགྱུར་བའི་སླད་དུའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: This will all come from having obtained this dhāraṇī.” “

source: ཤཱ་རིའི་བུ་ལེགས་སོ་ལེགས་སོ།
en: Excellent, Śāriputra, excellent!

source: །དེ་དེ་བཞིན་ནོ།
en: It is so!

source: ཁྱོད་ཀྱིས་ཇི་སྐད་སྨྲས་པ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་གིས་གཟུངས་འདི་ཐོབ་པར་གྱུར་ན། གང་ཟག་དེ་ནི་སངས་རྒྱས་དང་ཐ་དད་པ་མེད་པར་རིག་པར་བྱའོ།
en: replied the Bhagavat. “Just as you have said, if a bodhisattva obtains this dhāraṇī, that individual should be known to be no different from the buddhas.

source: །གང་ལ་ལ་ཞིག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་མཆོད་ཅིང་བཀུར་སྟི་བྱེད་པ་དང་། བླ་མར་བྱེད་ཅིང་ཡོ་བྱད་སྦྱིན་པར་བྱེད་ན་དེ་ནི་སངས་རྒྱས་རྣམས་ལ་མཆོད་པ་བྱས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Someone who makes offerings to, honors, venerates, and provides requisites for that bodhisattva should be known as making offerings to the buddhas. “

source: །ཤཱ་རིའི་བུ་གང་ཟག་གཞན་གང་ལ་ལ་ཞིག་གཟུངས་འདི་ཐོས་ནས་ལེན་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་དུ་འདོན་པ་དང་། མངོན་པར་ཡིད་ཆེས་པར་གྱུར་པ་དེ་ལ་འདི་ལྟར་སངས་རྒྱས་དང་ཐ་དད་པ་མེད་པར་བཀུར་སྟི་བྱས་ནས་མཆོད་ཅིང་རིམ་གྲོ་བྱས་ན་རྒྱུ་དང་རྐྱེན་དེས་བླ་ན་མེད་པའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཟུངས་སྔགས་བཀའ་སྩལ་པ། ཏདྱ་ཐཱ། སན་དྷཱ་ར་ཎི། ཨུཏ་དྷཱ་ར་ཎི། སུ་སཾ་པྲ་ཏིཥྛི་ཏེ། སུ་ནཱ་མ། སུ་པྲ་ཏིཥྛི་ཏེ། བི་ཛ་ཡ་བ་ལ། སཏྟྱ་པྲ་ཏི་ཛྙཱ། སུ་ཨཱ་རོ་ཧ། ཛྙཱ་ན་པྲ་ཏི། ཨུཏྤཱ་ད་ནི། ཨ་བ་ནཱ་བ་ནི། ཨ་བྷི་ཥིཉྩ་ནི། ཨ་བྷི་བ་ཡ་ཧཱ་ར། ཤུ་བྷ་བ་ཏི། སུ་ནི་ཤྲི་ཏ། བ་ཧུ་གུཾ་བྷ། ཨ་བྷི་བ་དཱ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་མངོན་པར་ཞེན་པ་མེད་པའི་གཟུངས་ཀྱི་ཚིག་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་རབ་ཏུ་གནས་ནས་ཡང་དག་པར་འཛིན་པར་བྱེད་ན། གང་ཟག་དེ་ནི་བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ།
en: Śāriputra, if any other individual who hears, acquires, possesses, reads, recites, and believes in this dhāraṇī is honored, offered to, and served as if they are in that way no different from the buddhas, then through that cause and condition the highest result will be attained.”

source: བསྐལ་པ་བརྒྱ་སྟོང་གི་བར་དུ་ཡང་དག་པའི་སྨོན་ལམ་བསྐྱེད་པ་མཐར་ཐུག་པ་མེད་ཅིང་རལ་གྲི་དང་། དབྱུག་པ་དང་། དུག་དང་། ཆུ་དང་། མེ་དང་། གཅན་གཟན་མ་རུངས་པ་རྣམས་ཀྱིས་དེའི་ལུས་ལ་གནོད་པར་བྱེད་མི་ནུས་པར་རིག་པར་བྱའོ།
en: The Bhagavat then taught the dhāraṇī mantra: tadyathā sandhāraṇi utdhāraṇi susaṃpratiṣṭhite sunāma supratiṣṭhite vijayabala sattyapratijñā suāroha jñānapratiutpādani avanāvani abhiṣiñcani abhivyāhāra śubhavati suniḥśrita bahuguṃbha abhivadā svāhā | “Śāriputra,” said the Bhagavat, “know that if a bodhisattva is established in these words of the unbounded dhāraṇī and possesses it perfectly, then for one eon, for a hundred eons, for a thousand eons, for a hundred thousand eons, the true prayers created by that individual will not be concluded, and their body will not be harmed by swords, sticks, poison, water, fire, or vicious wild animals. “

source: ཤཱ་རིའི་བུ་མངོན་པར་ཞེན་པ་མེད་པའི་གཟུངས་འདི་ནི་འདས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡུམ་དང་། མ་བྱོན་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡུམ་དང་། ད་ལྟར་བཞུགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡུམ་ཡིན་པས་སོ།
en: Śāriputra, it is because this Dhāraṇī of Nonattachment is the mother of the buddhas of the past, the mother of the buddhas of the future, and the mother of the buddhas of the present. “

source: །ཤཱ་རིའི་བུ་གང་ལ་ལ་ཞིག་གིས་གྲངས་མེད་པ་བཅུའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་སྟེ་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ནས་བསྐལ་པ་གྲངས་མེད་པའི་བར་དུ་ན་བཟའ་དང་། ཞལ་ཟས་མཆོག་དམ་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་མཆོད་པ་བྱས་པ་བས། གང་ལ་ལ་ཞིག་གིས་གཟུངས་འདི་ནི་ཐ་ན་ཚིག་གཅིག་ཙམ་ཡང་དག་པར་བཟུང་བ་ལས་བྱུང་བའི་བསོད་ནམས་གང་ཡིན་པ་དེ་ཆེས་རབ་ཏུ་མང་ངོ་།
en: Śāriputra, if someone were to fill ten asaṃkhyeya trichiliocosm world realms with the seven jewels and offer them to the tathāgatas, and were to offer them excellent, perfect clothing and food of various kinds for asaṃkhyeya eons, the merit that comes from someone who possesses just one word of this dhāraṇī would be still far greater. “

source: ཤཱ་རིའི་བུ་མངོན་པར་ཞེན་པ་མེད་པའི་གཟུངས་ཤིན་ཏུ་ཟབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡུམ་ཡིན་པའི་ཕྱིར་རོ།
en: Śāriputra, it is because this extremely profound Dharma teaching of the unbounded dhāraṇī is the mother of the tathāgatas.”

source: །དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། འཁོར་མང་པོ་རྣམས་ལ་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་ཐོས་ནས་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་གྱུར་པས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་འཛིན་པར་མོས་པར་གྱུར་ཏོ།
en: At that time, Śāriputra and the entire great assembly became extremely joyful on hearing those words, so that they all wished to possess that dhāraṇī.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་མངོན་པར་ཞེན་པ་མེད་པའི་གཟུངས་ཀྱི་ལེའུ་སྟེ་བཅུ་གསུམ་པའོ།། །།
en: The conclusion of “The Dhāraṇī of Nonattachment,” the thirteenth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་མང་པོའི་ནང་དུ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཁྱོད་ཀྱིས་འདི་ལྟར་ཤེས་པར་བྱ་སྟེ། ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ཞེས་བྱ་བའི་གཟུངས་གནོད་པ་ཐམས་ཅད་རིང་དུ་སྤོང་བ་འབྲུག་དང་གློག་མ་རུངས་པ་ཐམས་ཅད་འགོག་ཅིང་འཇིལ་བར་བྱེད་པ་ཡོད་དེ།
en: Chapter 14: The Precious Wish-Fulfilling Jewel Dhāraṇī Then the Bhagavat, in the midst of the great assembly, said to Venerable Ānanda, “You should know this: the dhāraṇī called the precious wish-fulfilling jewel will cast all harm far away; it will prevent and dispel all harmful thunder and lightning.

source: དེ་ནི་འདས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་གསུངས་པ་ཡིན་པས།
en: That is the teaching of the bhagavat arhat samyaksaṃbuddhas of the past.

source: ངས་ཀྱང་དེང་མདོ་སྡེ་འདི་ལྷ་དང་མི་རྣམས་ལ་ཕན་པ་དང་། འཇིག་རྟེན་ལ་བརྩེ་བ་དང་། ཐམས་ཅད་ཡོངས་སུ་བསྲུངས་ནས་བདེ་བ་འཐོབ་པར་བྱ་བའི་ཕྱིར་འཁོར་མང་པོ་ཁྱེད་ལ་ཡང་དག་པར་བསྟན་པར་བྱའོ།
en: Therefore, I also will teach it to you, this great assembly, in order to benefit devas and humans, to care for the world, so that all will be protected and attain happiness.”

source: །དེ་ནས་འཁོར་མང་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་ཐོས་པ་དང་། སོ་སོ་ནས་སེམས་རྩེ་གཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་དུ་བལྟས་ནས་རིག་སྔགས་མཉན་པར་གྱུར་ཏོ།
en: On hearing the Bhagavat’s words, Venerable Ānanda and everyone in the great assembly single-mindedly looked upon the Bhagavat’s face and listened to the vidyāmantra.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱེད་ཅག་ལེགས་པར་ཉོན་ཅིག །
en: The Bhagavat said, “You should listen well.

source: འདི་ནས་ཤར་ཕྱོགས་ན་གློག་འོད་སྣང་བའི་རྒྱལ་པོ་ཨ་ག་ཏ་ཞེས་བྱ་བ་དང་། ལྷོ་ཕྱོགས་ན་གློག་འོད་སྣང་བའི་རྒྱལ་པོ་ཤ་ཏེ་རུ་ཞེས་བྱ་བ་དང་། ནུབ་ཕྱོགས་ན་གློག་འོད་སྣང་བའི་རྒྱལ་པོ་ཙུ་ཏེ་ཀྭང་ཞེས་བྱ་བ་དང་། བྱང་ཕྱོགས་ན་གློག་འོད་སྣང་བའི་རྒྱལ་པོ་སུ་ཏ་མ་ནི་ཞེས་བྱ་བ་སོ་སོ་ན་ཡོད་དེ།
en: In the eastern direction from here, there is Āgata, the king of lightning; to the south there is Kṣaṇaśatara, the king of lightning; to the west there is Kṣaṇaprabha, the king of lightning; and to the north there is Satamapati, the king of lightning. “

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་གློག་གི་རྒྱལ་པོ་འདི་དག་གི་མིང་ཐོས་ཤིང་ཕྱོགས་ཤེས་པར་གྱུར་ན། གང་ཟག་དེ་འཇིགས་ཤིང་སྐྲག་པའི་དངོས་པོ་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་ཞིང་གློ་བུར་གྱི་གནོད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: If a noble man or noble woman hears the names of these kings of lightning and knows their directions, then that individual will be free from anything that terrifies or frightens, and all sudden harms will cease. “

source: །གལ་ཏེ་གང་དུ་གནས་པའི་གནས་དེར་ཕྱོགས་བཞིའི་གློག་གི་རྒྱལ་པོ་འདི་དག་གི་མིང་ཡི་གེར་བྲིས་པར་གྱུར་ན་གང་དུ་གནས་པའི་གནས་དེ་དག་ཏུ་འབྲུག་དང་གློག་གིས་འཇིགས་པ་མེད་ཅིང་གདོན་བགེགས་དང་གནོད་པའི་སྒྲིབ་པ་མེད་པར་འགྱུར།
en: If the names of these kings of lightning in the four directions are written in the place where they are dwelling, then there will be no danger from lightning in that place where they dwell, and there will be no impediments from demons, obstacle makers, or calamities.

source: དུས་མ་ཡིན་པར་གློ་བུར་དུ་འཆི་བ་ཐམས་ཅད་ཐག་རིང་དུ་སྤོང་བར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཟུངས་སྔགས་བཀའ་སྩལ་པ། ཏདྱ་ཐཱ། ནི་མི་ནི་མི་ནི་མིནྡྷ་རི་ཨིན་དྲེ་སྟྲཻ་ལོ་ཀ །ལོ་ཀ་ནི། ཤི་རི་ཤོ་ལ་བ་ཏི། ཧ་རཀྵ་ཧ་རཀྵ། བདག་མིང་འདི་ཞེས་བྱ་བའི་གནས་འདིར་འཇིགས་ཤིང་སྐྲག་པ་ཐམས་ཅད་དང་།
en: All sudden, premature death will be cast far away.”

source: སྡུག་བསྔལ་ཐམས་ཅད་ཀྱིས་འཚེ་བ་དང་། འབྲུག་དང་། གློག་དང་། ཐོག་འབབ་པ་དང་། གློ་བུར་དུ་འཆི་བར་འགྱུར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་བྲལ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ། དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་འཁོར་མང་པོའི་ནང་དུ་འདུག་པའི་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་གུས་པས་ཐལ་མོ་སྦྱར་ཏེ།
en: Then the Bhagavat recited the dhāraṇī mantra: tadyathā nimi nimi nimindhari indrestrai loka lokani śiriśolavati harakṣa harakṣa | May this place where I, [say your name], dwell be free from all fear and terror, from all harm from suffering, and from all thunder, lightning, hailstorms, and sudden death.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཀྱང་དེང་ལྷ་དང་མི་རྣམས་ལ་སྨན་པར་བགྱི་བ་དང་། འཇིག་རྟེན་ལ་བརྩེ་བ་དང་། ཐམས་ཅད་ཡོངས་སུ་བསྲུངས་ནས་བདེ་བ་འཐོབ་པར་བགྱི་བ་དང་། མཐུ་ཆེན་པོའི་སྟོབས་དང་ལྡན་ཞིང་སྨོན་པ་རྣམས་ཡིད་བཞིན་དུ་འགྲུབ་པར་བགྱི་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེའི་གཟུངས་གང་ལགས་པ་མདོ་ཙམ་ཞིག་བསྟན་པར་བགྱིའོ། །དེ་ནས་གཟུངས་སྔགས་སྨྲས་པ། ཏདྱ་ཐཱ། ཀ་ཊེ། བི་ཀ་ཊེ། ནི་ཀ་ཊེ། པྲ་ཏྱརྠི་ཀེ །པྲ་ཏྱ་མི་ཏྲེ། ཤུདྡྷེ་མུཀྟེ། བི་མ་ལེ། པྲ་བྷཱ་སྭ་རེ། ཨཎྜ་རེ། པཎྜ་རེ། ཤྭེ་ཏེ། པཎྜ་ར་བཱ་སི་ནི། ཧ་རི་ཀཎྜ་རི།
en: Svāhā | Then the bodhisattva mahāsattva Avalokiteśvara rose from his seat within that great assembly and, baring one shoulder, reverently placed his palms together and said to the Bhagavat, “Bhagavat, I also, in the presence of the Bhagavat, will briefly teach a precious wish-fulfilling jewel dhāraṇī in order to benefit devas and humans, to care for the world, so that all will be protected and attain happiness, and so that they will have the strength of great might and their aspirations will be accomplished exactly as wished for.”

source: པིངྒ་ལ། ཨ་ཀྵི་ད་དྷི་མུ་ཁི་རཀྵ་རཀྵ། བདག་མིང་འདི་ཞེས་བགྱི་བའི་གནས་འདིར་འཇིགས་ཤིང་སྐྲག་པ་ཐམས་ཅད་དང་། སྡུག་བསྔལ་གྱིས་འཚེ་བ་ནས་གློ་བུར་དུ་འཆི་བའི་བར་ཐམས་ཅད་བྲལ་བར་གྱུར་ཅིག །བདག་གིས་སྡིག་པའི་དངོས་པོ་ངན་པ་ཐམས་ཅད་མི་མཐོང་ཞིང་རྟག་པར་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཐུགས་རྗེ་ཆེན་པོའི་བྱིན་གྱིས་བརླབས་ཀྱིས་དགོངས་ཤིང་ཡོངས་སུ་བསྲུང་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: He then spoke the dhāraṇī mantra: tadyathā kate vikate nikate pratyarthike pratyamitre śuddhe mukte vimale prabhāsvare aṇḍare paṇḍare śvete paṇḍaravāsini harikaṇḍari piṅgala akṣi dadhi mukhi rakṣa rakṣa | May this place where I, [your name], dwell be free from all fear and terror, from all harm from suffering, and from all thunder, lightning, hailstorms, and sudden death, May I never see any bad, sinful thing but always be looked upon by the bodhisattva Ārya Avalokiteśvara with the blessing of his great compassion and be completely protected!

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་གསང་བའི་བདག་པོ་སྟན་ལས་ལངས་ཏེ་གུས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེང་ལྷ་དང་མི་རྣམས་ལ་སྨན་པ་ཆེར་བགྱི་བ་དང་། འཇིག་རྟེན་ལ་བརྩེ་བ་དང་། ཐམས་ཅད་ཡོངས་སུ་བསྲུངས་ནས་གཟི་བྱིན་ཆེན་པོའི་མཐུ་དང་ལྡན་པ་དང་། སྨོན་པ་རྣམས་ཡིད་བཞིན་དུ་འགྲུབ་པར་བགྱི་བའི་ཆེད་དུ་མི་ཕམ་པ་ཞེས་བགྱི་བའི་གཟུངས་བཤད་པར་བགྱིའོ། །དེ་ནས་གཟུངས་སྔགས་སྨྲས་པ། ཏདྱ་ཐཱ། མུ་ནི་མུ་ནི། མུ་ནི་ན་དྷ་རི། མུ་ནི་མ་ཏི་མ་ཏི། སུ་མ་ཏི། མ་ཧཱ་མ་ཏི། ཧཱ་ཧཱ་ཧཱ་ཧཱ་མ་བྷ་ཡནྟཱི་ཏི་པཱ་པ། བཛྲ་པཱ་ཎི་ཨཱ་ཧ་དྲཱ་བི་ཌ་སྭཱ་ཧཱ།
en: Svāhā | Then the bodhisattva Vajrapāṇi, the lord of secrets, rose from his seat, reverently placed his palms together, and said to the Bhagavat, “Bhagavat, I also will teach the dhāraṇī called invincible in order to greatly benefit devas and humans, to care for the world, so that all will be protected and attain the power of great resplendence, and so that their aspirations will be accomplished exactly as wished for.”

source: བཅོམ་ལྡན་འདས་བདག་གིས་གཟུངས་སྔགས་འདི་ནི་མི་ཕམ་པར་སྲུང་བ་ཞེས་བགྱི་སྟེ། སྐྱེས་པའམ་བུད་མེད་གང་ལ་ལ་ཞིག་སེམས་རྩེ་གཅིག་ཏུ་ཡང་དག་པར་བཟུང་སྟེ་ཡི་གེར་འདྲི་བ་དང་། ཀློག་པ་དང་། འདོན་པ་དང་། མི་བསྐྱུད་ཅིང་རྗེས་སུ་དྲན་པར་བགྱིད་ན་བདག་གདུགས་མཚན་དུ་དེ་ལ་ཡོངས་སུ་བསྲུང་བར་བགྱིད་པས་འཇིགས་ཤིང་སྐྲག་པ་ཐམས་ཅད་ནས་གློ་བུར་དུ་འཆི་བ་ཐམས་ཅད་ཐག་རིང་དུ་སྤོང་བར་འགྱུར་ལགས་སོ། །དེ་ནས་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བདག་པོ་ཚངས་པ་ཆེན་པོ་སྟན་ལས་ལངས་ཏེ། གུས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He then spoke the dhāraṇī mantra: tadyathā muni muni muni nadhari muni mati mati sumati mahāmati hā hā hā hā ma bhayantīti pāpa vajrapāṇi āha drāviḍa svāhā | “Bhagavat, I will guard day and night any man or woman who single-mindedly possesses this dhāraṇī mantra called invincible, writes it out, reads it, recites it, and remembers it without omission, so that all terror and fear, and so on, up to all sudden death will be cast far away.”

source: །བཅོམ་ལྡན་འདས་བདག་ལ་ཡང་ཤིན་ཏུ་གྱ་ནོམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་གཟུངས་ལྷ་དང་མི་རྣམས་ལ་རྒྱ་ཆེར་ཕན་འདོགས་པ། འཇིག་རྟེན་ལ་རབ་ཏུ་འཚེ་བ་ཐམས་ཅད་ཡོངས་སུ་སྲུང་བར་བགྱིད་པ། གཟི་བྱིན་ཆེན་པོའི་མཐུ་དང་ལྡན་པ། སྨོན་པ་རྣམས་ཡིད་བཞིན་དུ་འགྲུབ་པར་བགྱིད་པ་མཆིས་ཏེ། གཟུངས་སྔགས་དེ་བཤད་པར་བགྱིའོ། །ཏདྱ་ཐཱ། ཧི་ལི་མི་ལི། ཙི་ལི་སྭཱ་ཧཱ། བྲཧྨཔཱུ་རེ་སྭཱ་ཧཱ། བྲཧྨ་སྭ་རེ་སྭཱ་ཧཱ།
en: Then Mahābrahmā, the lord of the Sahā trichiliocosm, rose from his seat, reverently placed his palms together, and said to the Bhagavat, “Bhagavat, I also will teach the dhāraṇī that is a wonderful Dharma teaching in order to greatly benefit devas and humans, to protect the world from all harm, to attain the power of great magnificence, and so that their aspirations will be accomplished exactly as wished for.”

source: བྲཧྨ་བྷི་སུ་གརྦྷེ། པུཥྤ་སཾ་སྟ་རེ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་བདག་གི་གཟུངས་འདི་ནི་ཚངས་པའི་ཆད་པས་བཅད་པ་ཞེས་བགྱི་སྟེ་གཟུངས་འདི་འཛིན་པ་དག་ལ་ཡོངས་སུ་བསྲུང་བར་བགྱིད་པས་མྱ་ངན་གྱིས་གནོད་པ་དང་། སྡིག་པའི་ལས་རྣམས་ཐག་རིང་དུ་སྤོང་ཞིང་། གློ་བུར་དུ་འཆི་བའི་བར་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་སྤོང་བར་བགྱིད་དོ།
en: He then spoke the dhāraṇī mantra: tadyathā hili mili cili svāhā brahmapūre svāhā brahmasvare svāhā brahmabhisugarbhe puṣpasaṃstare svāhā | “Bhagavat, this dhāraṇī mantra is called Brahmā’s punishment, and I will guard those who possess this dhāraṇī, so that all harm from misery and all bad actions will be cast far away and all sudden death will be cast away.”

source: །དེ་ནས་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་སྟན་ལས་ལངས་ཏེ་གུས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ལ་ཡང་བཛྲ་ཤ་ནི་ཞེས་བགྱི་བའི་གཟུངས་རིག་སྔགས་ཆེན་མོ་འཇིགས་ཤིང་སྐྲག་པ་དང་། གདོན་བགེགས་ཐམས་ཅད་རབ་ཏུ་སེལ་བ། གློ་བུར་དུ་འཆི་བའི་བར་ཐམས་ཅད་ཐག་རིང་དུ་སྤོང་བ་སྡུག་བསྔལ་ལས་དྲངས་ནས་བདེ་བ་སྩོལ་བ་ལྷ་དང་མི་རྣམས་ལ་སྨན་པར་བགྱིད་པ་མཆིས་ཏེ་གཟུངས་དེ་བཤད་པར་བགྱིའོ། །ཏདྱ་ཐཱ། ནི་བ་རཱ་ཎི། བནྡྷ་མཱ་དནྟི་མ་ཏི་ཏི་ཏི་ཏི། གཽ་རཱི་གནྡྷ་རི། ཙཎྜ་ལི། མཱ་ཏངྒི། པུཀྐ་སི། པ་ར་ཎ་ལེ་ཧི་ན་མ་དྷྱ་མ་དྷ་རི་ཎི། མ་ལ་ནི། ད་ལ་མ་ད་དེ། ཙ་དྲཱ་བཱ་ཀྲཱི། ཤ་བ་རི་ཤ་བ་རི་སྭཱ་ཧཱ། དེ་ནས་ལྷའི་རྒྱལ་པོ་རྣམ་ཐོས་དང་། ལྷའི་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་དང་། ལྷའི་རྒྱལ་པོ་འཕགས་སྐྱེས་པོ་དང་། ལྷའི་རྒྱལ་པོ་མིག་མི་བཟང་ཅིག་ཅར་སྟན་ལས་ལངས་ཏེ་གུས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ལ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཇིགས་པ་སྦྱིན་པ་ཞེས་བགྱི་བའི་གཟུངས་སྡུག་བསྔལ་གྱིས་ཉོན་མོངས་པ་ལས་རྟག་པར་ཡོངས་སུ་བསྐྱབས་ནས་བདེ་བ་ཐོབ་པར་བགྱིད་པ་ཚེ་འཕེལ་བར་བགྱིད་ཅིང་ནད་ཀྱི་སྡུག་བསྔལ་མ་མཆིས་པར་བགྱིད་པ་གློ་བུར་དུ་འཆི་བའི་བར་ཐམས་ཅད་ཐག་རིང་དུ་སྤོང་བར་བགྱིད་པ་མཆིས་ཏེ་གཟུངས་སྔགས་དེ་བརྗོད་པར་བགྱིའོ། །ཏདྱ་ཐཱ། པུཥྤེ། སུ་པུཥྤེ། དྷུ་མ་པ་རི་ཧཱ་རེ། ཨཱརྱ་པྲ་ཤ་སྟེ་ཤཱནྟི། ནིརྨུ་ཀྟེ། མཾ་ག་ལྱ། ཧི་ར་ཎྱ་གརྦྷེ་སྟུ་ཏེ། སྟ་བི་ཏེ་སྭཱ་ཧཱ། དེ་ནས་ཡང་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་མང་པོ་འདི་ལྟ་སྟེ། ཀླུའི་རྒྱལ་པོ་ནཱ་ག་སི་དང་། ཀླུའི་རྒྱལ་པོ་གློག་འོད་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་།
en: Then Śakra, the lord of devas, rose from his seat, reverently placed his palms together, and said to the Bhagavat, “Bhagavat, I also will teach a great dhāraṇī vidyāmantra called vajraśani in order to dispel all fear and terror, demons, obstacle makers, and so on, up to casting far away all sudden death, and to save them from suffering, bestowing happiness and benefit upon devas and humans.
